# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

num = int(input('Please enter a number: '))
print(f'Corresponding letter for this number is \'{chr(num)}\'')