# 8.	Определить, является ли год, который ввел пользователем,
# високосным или не високосным.
#Год является високосным в двух случаях: либо он кратен 4,
# но при этом не кратен 100, либо кратен 400.

'''
Примечания ко всем задачам урока:
1.	Решите задачу при помощи линейного алгоритма или алгоритма с ветвлением (цикл и рекурсии будут на уроке 2 и тут их не используем для решения).
2.	Аналогично п. 1. массивы пройдём на уроке 3, поэтому постарайтесь решить задачи без них.
3.	Если речь идёт о символах, используйте только строчные буквы английского алфавита.
'''

try:
    year = int(input('Пожалуйста введите год:'))
    if year//400 == 0 or (year//4==0 and year//100!=0)

except:
    print('Данные не верны')