"""
5.	Вывести на экран коды и символы таблицы ASCII, начиная с символа
под номером 32 и заканчивая 127-м включительно.
Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.
"""
start = 32
end = 127
c = 0   # counter of items in one line
for i in range(start,end+1):
    c += 1
    print(f'{i}-{chr(i)}', end='  ')
    if c == 10:
        print('\n')
        c = 0

